apache/nuttx/arch/arm/include/sam34/sam3x_irq.h
#ifdef CONFIG_SAM34_GPIOF_IRQ
#  define SAM_IRQ_GPIOF_PINS  (SAM_IRQ_EXTINT + SAM_IRQ_NEXTINT + SAM_NGPIOAIRQS + \
                               SAM_NGPIOBIRQS + SAM_NGPIOCIRQS + SAM_NGPIODIRQS + \
                               SAM_NGPIOEIRQS)
#  define SAM_IRQ_PF0         (SAM_IRQ_GPIOF_PINS+0)          /* GPIOF, PIN 0 */
#  define SAM_IRQ_PF1         (SAM_IRQ_GPIOF_PINS+1)          /* GPIOF, PIN 1 */
#  define SAM_IRQ_PF2         (SAM_IRQ_GPIOF_PINS+2)          /* GPIOF, PIN 2 */
#  define SAM_IRQ_PF3         (SAM_IRQ_GPIOF_PINS+3)          /* GPIOF, PIN 3 */
#  define SAM_IRQ_PF4         (SAM_IRQ_GPIOF_PINS+4)          /* GPIOF, PIN 4 */
#  define SAM_IRQ_PF5         (SAM_IRQ_GPIOF_PINS+5)          /* GPIOF, PIN 5 */
#  define SAM_IRQ_PF6         (SAM_IRQ_GPIOF_PINS+6)          /* GPIOF, PIN 6 */
#  define SAM_IRQ_PF7         (SAM_IRQ_GPIOF_PINS+7)          /* GPIOF, PIN 7 */
#  define SAM_IRQ_PF8         (SAM_IRQ_GPIOF_PINS+8)          /* GPIOF, PIN 8 */
#  define SAM_IRQ_PF9         (SAM_IRQ_GPIOF_PINS+9)          /* GPIOF, PIN 9 */
#  define SAM_IRQ_PF10        (SAM_IRQ_GPIOF_PINS+10)         /* GPIOF, PIN 10 */
#  define SAM_IRQ_PF11        (SAM_IRQ_GPIOF_PINS+11)         /* GPIOF, PIN 11 */
#  define SAM_IRQ_PF12        (SAM_IRQ_GPIOF_PINS+12)         /* GPIOF, PIN 12 */
#  define SAM_IRQ_PF13        (SAM_IRQ_GPIOF_PINS+13)         /* GPIOF, PIN 13 */
#  define SAM_IRQ_PF14        (SAM_IRQ_GPIOF_PINS+14)         /* GPIOF, PIN 14 */
#  define SAM_IRQ_PF15        (SAM_IRQ_GPIOF_PINS+15)         /* GPIOF, PIN 15 */
#  define SAM_IRQ_PF16        (SAM_IRQ_GPIOF_PINS+16)         /* GPIOF, PIN 16 */
#  define SAM_IRQ_PF17        (SAM_IRQ_GPIOF_PINS+17)         /* GPIOF, PIN 17 */
#  define SAM_IRQ_PF18        (SAM_IRQ_GPIOF_PINS+18)         /* GPIOF, PIN 18 */
#  define SAM_IRQ_PF19        (SAM_IRQ_GPIOF_PINS+19)         /* GPIOF, PIN 19 */
#  define SAM_IRQ_PF20        (SAM_IRQ_GPIOF_PINS+20)         /* GPIOF, PIN 20 */
#  define SAM_IRQ_PF21        (SAM_IRQ_GPIOF_PINS+21)         /* GPIOF, PIN 21 */
#  define SAM_IRQ_PF22        (SAM_IRQ_GPIOF_PINS+22)         /* GPIOF, PIN 22 */
#  define SAM_IRQ_PF23        (SAM_IRQ_GPIOF_PINS+23)         /* GPIOF, PIN 23 */
#  define SAM_IRQ_PF24        (SAM_IRQ_GPIOF_PINS+24)         /* GPIOF, PIN 24 */
#  define SAM_IRQ_PF25        (SAM_IRQ_GPIOF_PINS+25)         /* GPIOF, PIN 25 */
#  define SAM_IRQ_PF26        (SAM_IRQ_GPIOF_PINS+26)         /* GPIOF, PIN 26 */
#  define SAM_IRQ_PF27        (SAM_IRQ_GPIOF_PINS+27)         /* GPIOF, PIN 27 */
#  define SAM_IRQ_PF28        (SAM_IRQ_GPIOF_PINS+28)         /* GPIOF, PIN 28 */
#  define SAM_IRQ_PF29        (SAM_IRQ_GPIOF_PINS+29)         /* GPIOF, PIN 29 */
#  define SAM_IRQ_PF30        (SAM_IRQ_GPIOF_PINS+30)         /* GPIOF, PIN 30 */
#  define SAM_IRQ_PF31        (SAM_IRQ_GPIOF_PINS+31)         /* GPIOF, PIN 31 */
#  define SAM_NGPIOFIRQS      32
#else
#  define SAM_NGPIOFIRQS      0
#endif

/* Total number of IRQ numbers */

#define NR_IRQS               (SAM_IRQ_EXTINT + SAM_IRQ_NEXTINT + \
                               SAM_NGPIOAIRQS + SAM_NGPIOBIRQS + SAM_NGPIOCIRQS + \
                               SAM_NGPIODIRQS + SAM_NGPIOEIRQS + SAM_NGPIOFIRQS)

/****************************************************************************************
 * Public Types
 ****************************************************************************************/

/****************************************************************************************
 * Inline functions
 ****************************************************************************************/

/****************************************************************************************
 * Public Data
 ****************************************************************************************/

/****************************************************************************************
 * Public Function Prototypes
 ****************************************************************************************/

#ifndef __ASSEMBLY__
#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

#undef EXTERN
#ifdef __cplusplus
}
#endif
#endif

#endif /* __ARCH_ARM_INCLUDE_SAM34_SAM3X_IRQ_H */
